experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_700rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1609.599ms, rate sampling interval: 7061ms
  Thread calibration: mean lat.: 1349.821ms, rate sampling interval: 6164ms
  Thread calibration: mean lat.: 1496.047ms, rate sampling interval: 6356ms
  Thread calibration: mean lat.: 1475.539ms, rate sampling interval: 6533ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.74s     7.86s   33.21s    63.40%
    Req/Sec   122.21      6.47   137.00     80.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.02s 
 75.000%   20.84s 
 90.000%   25.51s 
 99.000%   33.21s 
 99.900%   36.47s 
 99.990%   37.91s 
 99.999%   38.04s 
100.000%   38.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.243     0.000000            1         1.00
    4653.055     0.100000         3939         1.11
    7176.191     0.200000         7878         1.25
    9428.991     0.300000        11825         1.43
   11763.711     0.400000        15760         1.67
   14024.703     0.500000        19701         2.00
   15335.423     0.550000        21657         2.22
   16596.991     0.600000        23628         2.50
   18022.399     0.650000        25606         2.86
   19578.879     0.700000        27586         3.33
   20840.447     0.750000        29537         4.00
   21413.887     0.775000        30520         4.44
   22069.247     0.800000        31502         5.00
   22724.607     0.825000        32504         5.71
   23445.503     0.850000        33472         6.67
   24395.775     0.875000        34456         8.00
   24969.215     0.887500        34954         8.89
   25509.887     0.900000        35445        10.00
   26066.943     0.912500        35935        11.43
   26673.151     0.925000        36425        13.33
   27328.511     0.937500        36923        16.00
   27656.191     0.943750        37172        17.78
   28098.559     0.950000        37411        20.00
   28606.463     0.956250        37653        22.86
   29179.903     0.962500        37902        26.67
   29769.727     0.968750        38154        32.00
   30031.871     0.971875        38268        35.56
   30523.391     0.975000        38393        40.00
   31211.519     0.978125        38514        45.71
   31801.343     0.981250        38637        53.33
   32210.943     0.984375        38762        64.00
   32522.239     0.985938        38823        71.11
   32784.383     0.987500        38885        80.00
   32997.375     0.989062        38945        91.43
   33357.823     0.990625        39006       106.67
   33751.039     0.992188        39074       128.00
   33980.415     0.992969        39101       142.22
   34242.559     0.993750        39132       160.00
   34406.399     0.994531        39160       182.86
   34635.775     0.995313        39194       213.33
   34996.223     0.996094        39228       256.00
   35094.527     0.996484        39238       284.44
   35389.439     0.996875        39253       320.00
   35618.815     0.997266        39269       365.71
   35782.655     0.997656        39283       426.67
   35913.727     0.998047        39299       512.00
   36044.799     0.998242        39307       568.89
   36241.407     0.998437        39317       640.00
   36306.943     0.998633        39322       731.43
   36405.247     0.998828        39330       853.33
   36470.783     0.999023        39340      1024.00
   36503.551     0.999121        39341      1137.78
   36569.087     0.999219        39347      1280.00
   36700.159     0.999316        39349      1462.86
   37126.143     0.999414        39352      1706.67
   37322.751     0.999512        39358      2048.00
   37322.751     0.999561        39358      2275.56
   37355.519     0.999609        39360      2560.00
   37421.055     0.999658        39364      2925.71
   37421.055     0.999707        39364      3413.33
   37552.127     0.999756        39366      4096.00
   37617.663     0.999780        39367      4551.11
   37715.967     0.999805        39368      5120.00
   37748.735     0.999829        39370      5851.43
   37748.735     0.999854        39370      6826.67
   37912.575     0.999878        39372      8192.00
   37912.575     0.999890        39372      9102.22
   37912.575     0.999902        39372     10240.00
   37912.575     0.999915        39372     11702.86
   37978.111     0.999927        39374     13653.33
   37978.111     0.999939        39374     16384.00
   37978.111     0.999945        39374     18204.44
   37978.111     0.999951        39374     20480.00
   37978.111     0.999957        39374     23405.71
   37978.111     0.999963        39374     27306.67
   37978.111     0.999969        39374     32768.00
   37978.111     0.999973        39374     36408.89
   38043.647     0.999976        39375     40960.00
   38043.647     1.000000        39375          inf
#[Mean    =    14740.910, StdDeviation   =     7864.388]
#[Max     =    38010.880, Total count    =        39375]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  44230 requests in 1.50m, 20.73MB read
Requests/sec:    491.40  
Transfer/sec:    235.85KB