experiment/results/compare_high_RPS/no_istio_20251231_173158/wrk_logs/wrk_800rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 2359.660ms, rate sampling interval: 9986ms
  Thread calibration: mean lat.: 2002.783ms, rate sampling interval: 8167ms
  Thread calibration: mean lat.: 2032.707ms, rate sampling interval: 7942ms
  Thread calibration: mean lat.: 1851.992ms, rate sampling interval: 7462ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.52s     9.67s   40.04s    61.92%
    Req/Sec   120.46      6.89   136.00     75.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.12s 
 75.000%   27.03s 
 90.000%   32.93s 
 99.000%   40.04s 
 99.900%   43.97s 
 99.990%   47.12s 
 99.999%   48.23s 
100.000%   48.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     301.567     0.000000            1         1.00
    6705.151     0.100000         3874         1.11
   10076.159     0.200000         7750         1.25
   13058.047     0.300000        11616         1.43
   16121.855     0.400000        15495         1.67
   19120.127     0.500000        19381         2.00
   20660.223     0.550000        21295         2.22
   22085.631     0.600000        23238         2.50
   23625.727     0.650000        25175         2.86
   25313.279     0.700000        27115         3.33
   27033.599     0.750000        29043         4.00
   27951.103     0.775000        30013         4.44
   28786.687     0.800000        30976         5.00
   29687.807     0.825000        31960         5.71
   30752.767     0.850000        32923         6.67
   31948.799     0.875000        33878         8.00
   32423.935     0.887500        34369         8.89
   32931.839     0.900000        34847        10.00
   33472.511     0.912500        35343        11.43
   34111.487     0.925000        35822        13.33
   34799.615     0.937500        36307        16.00
   35258.367     0.943750        36551        17.78
   35684.351     0.950000        36785        20.00
   36175.871     0.956250        37034        22.86
   36798.463     0.962500        37274        26.67
   37355.519     0.968750        37510        32.00
   37683.199     0.971875        37636        35.56
   38010.879     0.975000        37763        40.00
   38371.327     0.978125        37873        45.71
   38731.775     0.981250        37992        53.33
   39157.759     0.984375        38117        64.00
   39419.903     0.985938        38177        71.11
   39649.279     0.987500        38236        80.00
   39911.423     0.989062        38300        91.43
   40173.567     0.990625        38355       106.67
   40599.551     0.992188        38416       128.00
   40894.463     0.992969        38447       142.22
   41222.143     0.993750        38479       160.00
   41484.287     0.994531        38506       182.86
   41811.967     0.995313        38536       213.33
   42205.183     0.996094        38570       256.00
   42303.487     0.996484        38583       284.44
   42434.559     0.996875        38598       320.00
   42598.399     0.997266        38616       365.71
   42926.079     0.997656        38628       426.67
   43286.527     0.998047        38643       512.00
   43450.367     0.998242        38650       568.89
   43581.439     0.998437        38658       640.00
   43679.743     0.998633        38666       731.43
   43876.351     0.998828        38672       853.33
   43974.655     0.999023        38680      1024.00
   44007.423     0.999121        38684      1137.78
   44138.495     0.999219        38689      1280.00
   44236.799     0.999316        38692      1462.86
   44367.871     0.999414        38695      1706.67
   44597.247     0.999512        38699      2048.00
   44630.015     0.999561        38700      2275.56
   45023.231     0.999609        38702      2560.00
   45154.303     0.999658        38705      2925.71
   45285.375     0.999707        38706      3413.33
   45613.055     0.999756        38708      4096.00
   45776.895     0.999780        38709      4551.11
   45940.735     0.999805        38710      5120.00
   46104.575     0.999829        38711      5851.43
   46497.791     0.999854        38712      6826.67
   47120.383     0.999878        38713      8192.00
   47120.383     0.999890        38713      9102.22
   47218.687     0.999902        38714     10240.00
   47218.687     0.999915        38714     11702.86
   47480.831     0.999927        38715     13653.33
   47480.831     0.999939        38715     16384.00
   47480.831     0.999945        38715     18204.44
   48070.655     0.999951        38716     20480.00
   48070.655     0.999957        38716     23405.71
   48070.655     0.999963        38716     27306.67
   48070.655     0.999969        38716     32768.00
   48070.655     0.999973        38716     36408.89
   48234.495     0.999976        38717     40960.00
   48234.495     1.000000        38717          inf
#[Mean    =    19521.340, StdDeviation   =     9674.233]
#[Max     =    48201.728, Total count    =        38717]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  43406 requests in 1.50m, 18.09MB read
Requests/sec:    482.24  
Transfer/sec:    205.85KB